app/controllers/artists_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "artists".* FROM "artists"
---
  def index
    if params[:song_id]
      @artists = Song.find(params[:song_id]).artists
    else
      @artists = Artist.all