app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      if artist.nil?
        redirect_to artists_path, alert: "Artist not found."
      else
        @songs = Artist.find(params[:artist_id]).songs
      end
    else
      @songs = Song.all